; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v1)
             (pred_4 ?v13 ?v3)
             (pred_8 ?v5 ?v3)
             (pred_5 ?v11 ?v5 )
	     (pred_3 ?v5)
             (pred_1 ?v12)
             (pred_12 ?v13)
             (pred_2 ?v3)
             (pred_6 ?v5)
             (pred_11 ?v13)
             (pred_10 ?v5)
             (pred_7 ))



(:action op_1
:parameters (?v6 ?v2 ?v8 ?v7)
:precondition (and (pred_1 ?v6) (pred_1 ?v2) (pred_12 ?v8) (pred_2 ?v7)
          (pred_9 ?v6 ?v2) (pred_4 ?v8 ?v7)
                   (pred_8 ?v2 ?v7) (pred_3 ?v6) 
                   (pred_6 ?v2) (pred_11 ?v8))
:effect (and  (pred_10 ?v2) (not (pred_6 ?v2))))


(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_1 ?v6) (pred_1 ?v10)
               (pred_3 ?v6) (pred_9 ?v6 ?v10) (pred_10 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v6))))

(:action op_2
:parameters (?v6 ?v8)
:precondition (and (pred_1 ?v6) (pred_12 ?v8) 
                  (pred_3 ?v6) (pred_5 ?v8 ?v6) (pred_7 ))
:effect (and (pred_11 ?v8)
   (not (pred_5 ?v8 ?v6)) (not (pred_7 ))))


(:action op_5
:parameters (?v6 ?v4 ?v9)
:precondition (and (pred_1 ?v6) (pred_12 ?v4) (pred_12 ?v9)
                  (pred_3 ?v6) (pred_11 ?v9) (pred_5 ?v4 ?v6))
:effect (and (pred_11 ?v4) (pred_5 ?v9 ?v6)
        (not (pred_11 ?v9)) (not (pred_5 ?v4 ?v6))))

(:action op_4
:parameters (?v6 ?v8)
:precondition (and (pred_1 ?v6) (pred_12 ?v8) 
                  (pred_3 ?v6) (pred_11 ?v8))
:effect (and (pred_7 ) (pred_5 ?v8 ?v6) (not (pred_11 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_05 obj_02 obj_01 obj_18 obj_16 obj_14 obj_03 obj_06 obj_11 obj_07 obj_20 obj_09 obj_08 obj_04
    obj_17 obj_21
    obj_12 obj_15 obj_10
    )

    (:init
       (pred_7)

       (pred_1 obj_19)
       (pred_1 obj_13)
       (pred_1 obj_05)
       (pred_1 obj_02)
       (pred_1 obj_01)
       (pred_1 obj_18)
       (pred_1 obj_16)
       (pred_1 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_2 obj_17)
       (pred_2 obj_21)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_10)

       (pred_9 obj_19 obj_01)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_05 obj_16)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_01 obj_19)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_14)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_14 obj_16)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_11 obj_08)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_20 obj_09)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_20)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_11)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_08)
       (pred_6 obj_03)
       (pred_6 obj_19)
       (pred_6 obj_09)
       (pred_8  obj_03 obj_17)
       (pred_8  obj_19 obj_21)
       (pred_8  obj_09 obj_17)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_02)
       (pred_10 obj_01)
       (pred_10 obj_18)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_07)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_04)

       (pred_4  obj_12 obj_17)
       (pred_4  obj_15 obj_21)
       (pred_4  obj_10 obj_17)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_10 obj_11)
       (pred_3 obj_06)
    )

    (:goal (and
       (pred_5 obj_15 obj_11)
       (pred_5 obj_10 obj_08)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_3 obj_06 obj_18)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_18)
   goals met: 0 of 2
2. (op_3 obj_18 obj_01)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_01)
   goals met: 0 of 2
3. (op_2 obj_01 obj_15)
   deleted: (pred_5 obj_15 obj_01) (pred_7)
   added: (pred_11 obj_15)
   goals met: 0 of 2
4. (op_3 obj_01 obj_18)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_18)
   goals met: 0 of 2
5. (op_3 obj_18 obj_06)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_06)
   goals met: 0 of 2
6. (op_3 obj_06 obj_11)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_11)
   goals met: 0 of 2
7. (op_5 obj_11 obj_10 obj_15)
   deleted: (pred_11 obj_15) (pred_5 obj_10 obj_11)
   added: (pred_11 obj_10) (pred_5 obj_15 obj_11)
   goals met: 1 of 2
8. (op_3 obj_11 obj_08)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_08)
   goals met: 1 of 2
9. (op_4 obj_08 obj_10)
   deleted: (pred_11 obj_10)
   added: (pred_7) (pred_5 obj_10 obj_08)
   goals met: 2 of 2
